Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/deprecated/dma.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// dma.c - Driver for the dma Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup dma_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef DRIVERLIB_LEGACY_MODE

#if defined(__MSP430_HAS_DMAX_3__) || defined(__MSP430_HAS_DMAX_6__)
#include "dma.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the specified DMA channel.
//!
//! This function initializes the specified DMA channel. Upon successful
//! completion of initialization of the selected channel the control registers
//! will be cleared and the given variables will be set. Please note, if
//! transfers have been enabled with the enableTransfers() function, then a
//! call to disableTransfers() is necessary before re-initialization. Also
//! note, that the trigger sources are device dependent and can be found in the
//! device family data sheet. The amount of DMA channels available are also
//! device specific.
//!
//! \param baseAddress is the base address of the DMA module.
//! \param channelSelect is the specified channel to initialize.
//!        Valid values are:
//!        - \b DMA_CHANNEL_0
//!        - \b DMA_CHANNEL_1
//!        - \b DMA_CHANNEL_2
//!        - \b DMA_CHANNEL_3
//!        - \b DMA_CHANNEL_4
//!        - \b DMA_CHANNEL_5
//!        - \b DMA_CHANNEL_6
//!        - \b DMA_CHANNEL_7
//! \param transferModeSelect is the transfer mode of the selected channel.
//!        Valid values are:
//!        - \b DMA_TRANSFER_SINGLE [Default] - Single transfer, transfers
//!           disabled after transferAmount of transfers.
//!        - \b DMA_TRANSFER_BLOCK - Multiple transfers of transferAmount,
//!           transfers disabled once finished.
//!        - \b DMA_TRANSFER_BURSTBLOCK - Multiple transfers of transferAmount
//!           interleaved with CPU activity, transfers disabled once finished.
//!        - \b DMA_TRANSFER_REPEATED_SINGLE - Repeated single transfer by
//!           trigger.
//!        - \b DMA_TRANSFER_REPEATED_BLOCK - Multiple transfers of
//!           transferAmount by trigger.
//!        - \b DMA_TRANSFER_REPEATED_BURSTBLOCK - Multiple transfers of
//!           transferAmount by trigger interleaved with CPU activity.
//!        \n Modified bits are \b DMADT of \b DMAxCTL register.
//! \param transferSize is the amount of transfers to complete in a block
//!        transfer mode, as well as how many transfers to complete before the
//!        interrupt flag is set. Valid value is between 1-65535, if 0, no
//!        transfers will occur.
//!        \n Modified bits are \b DMAxSZ of \b DMAxSZ register.
//! \param triggerSourceSelect is the source that will trigger the start of
//!        each transfer, note that the sources are device specific.
//!        Valid values are:
//!        - \b DMA_TRIGGERSOURCE_0 [Default]
//!        - \b DMA_TRIGGERSOURCE_1
//!        - \b DMA_TRIGGERSOURCE_2
//!        - \b DMA_TRIGGERSOURCE_3
//!        - \b DMA_TRIGGERSOURCE_4
//!        - \b DMA_TRIGGERSOURCE_5
//!        - \b DMA_TRIGGERSOURCE_6
//!        - \b DMA_TRIGGERSOURCE_7
//!        - \b DMA_TRIGGERSOURCE_8
//!        - \b DMA_TRIGGERSOURCE_9
//!        - \b DMA_TRIGGERSOURCE_10
//!        - \b DMA_TRIGGERSOURCE_11
//!        - \b DMA_TRIGGERSOURCE_12
//!        - \b DMA_TRIGGERSOURCE_13
//!        - \b DMA_TRIGGERSOURCE_14
//!        - \b DMA_TRIGGERSOURCE_15
//!        - \b DMA_TRIGGERSOURCE_16
//!        - \b DMA_TRIGGERSOURCE_17
//!        - \b DMA_TRIGGERSOURCE_18
//!        - \b DMA_TRIGGERSOURCE_19
//!        - \b DMA_TRIGGERSOURCE_20
//!        - \b DMA_TRIGGERSOURCE_21
//!        - \b DMA_TRIGGERSOURCE_22
//!        - \b DMA_TRIGGERSOURCE_23
//!        - \b DMA_TRIGGERSOURCE_24
//!        - \b DMA_TRIGGERSOURCE_25
//!        - \b DMA_TRIGGERSOURCE_26
//!        - \b DMA_TRIGGERSOURCE_27
//!        - \b DMA_TRIGGERSOURCE_28
//!        - \b DMA_TRIGGERSOURCE_29
//!        - \b DMA_TRIGGERSOURCE_30
//!        - \b DMA_TRIGGERSOURCE_31
//!        \n Modified bits are \b DMAxTSEL of \b DMACTLx register.
//! \param transferUnitSelect is the specified size of transfers.
//!        Valid values are:
//!        - \b DMA_SIZE_SRCWORD_DSTWORD [Default]
//!        - \b DMA_SIZE_SRCBYTE_DSTWORD
//!        - \b DMA_SIZE_SRCWORD_DSTBYTE
//!        - \b DMA_SIZE_SRCBYTE_DSTBYTE
//!        \n Modified bits are \b DMASRCBYTE and \b DMADSTBYTE of \b DMAxCTL
//!        register.
//! \param triggerTypeSelect is the type of trigger that the trigger signal
//!        needs to be to start a transfer.
//!        Valid values are:
//!        - \b DMA_TRIGGER_RISINGEDGE [Default]
//!        - \b DMA_TRIGGER_HIGH - A trigger would be a high signal from the
//!           trigger source, to be held high through the length of the
//!           transfer(s).
//!        \n Modified bits are \b DMALEVEL of \b DMAxCTL register.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
bool DMA_init (uint16_t baseAddress,
    uint8_t channelSelect,
    uint16_t transferModeSelect,
    uint16_t transferSize,
    uint8_t triggerSourceSelect,
    uint8_t transferUnitSelect,
    uint8_t triggerTypeSelect)
{
    DMA_initializeParam param = {0};
    param.channelSelect = channelSelect;
    param.transferModeSelect = transferModeSelect;
    param.transferSize = transferSize;
    param.triggerSourceSelect = triggerSourceSelect;
    param.transferUnitSelect = transferUnitSelect;
    param.triggerTypeSelect = triggerTypeSelect;

